var ayaah = [
    {
        ayaah: 'وَسَیُجَنَّبُهَا ٱلۡأَتۡقَى',
        surah: 'Al-Lail'
    },
    {
        ayaah: 'إِنَّ ٱلۡإِنسَـٰنَ لَفِی خُسۡرٍ',
        surah: 'Al-Asr'
    },
    {
        ayaah: 'فَذَ ٰ⁠لِكَ یَوۡمَىِٕذࣲ یَوۡمٌ عَسِیرٌ',
        surah: 'Al Muddathir'
    },
    {
        ayaah: 'وَلَمَن صَبَرَ وَغَفَرَ إِنَّ ذَ ٰ⁠لِكَ لَمِنۡ عَزۡمِ ٱلۡأُمُورِ ',
        surah: 'Ash-Shura'
    },
    {
        ayaah: 'إِذࣰا لَّأَذَقۡنَـٰكَ ضِعۡفَ ٱلۡحَیَوٰةِ وَضِعۡفَ ٱلۡمَمَاتِ ثُمَّ لَا تَجِدُ لَكَ عَلَیۡنَا نَصِیرࣰا',
        surah: 'Al-Isra'
    },
    {
        ayaah: 'فَمَا زَالَت تِّلۡكَ دَعۡوَىٰهُمۡ حَتَّىٰ جَعَلۡنَـٰهُمۡ حَصِیدًا خَـٰمِدِینَ',
        surah: 'Al-Anbya'
    },
    {
        ayaah: 'أَلَمۡ تَرَ كَیۡفَ ضَرَبَ ٱللَّهُ مَثَلࣰا كَلِمَةࣰ طَیِّبَةࣰ كَشَجَرَةࣲ طَیِّبَةٍ أَصۡلُهَا ثَابِتࣱ وَفَرۡعُهَا فِی ٱلسَّمَاۤءِ',
        surah: 'Ibrahim'
    },
    {
        ayaah: 'وَلَوۡ أَنَّهُمۡ صَبَرُوا۟ حَتَّىٰ تَخۡرُجَ إِلَیۡهِمۡ لَكَانَ خَیۡرࣰا لَّهُمۡۚ وَٱللَّهُ غَفُورࣱ رَّحِیمࣱ',
        surah: 'Al-Hujurat'
    },
    {
        ayaah: 'ذَ ٰ⁠لِكَ بِأَنَّهُمۡ ءَامَنُوا۟ ثُمَّ كَفَرُوا۟ فَطُبِعَ عَلَىٰ قُلُوبِهِمۡ فَهُمۡ لَا یَفۡقَهُونَ',
        surah: 'Al-Munafiqun'
    },
    {
        ayaah: 'وَإِن جَنَحُوا۟ لِلسَّلۡمِ فَٱجۡنَحۡ لَهَا وَتَوَكَّلۡ عَلَى ٱللَّهِۚ إِنَّهُۥ هُوَ ٱلسَّمِیعُ ٱلۡعَلِیمُ',
        surah: 'Al-Anfal'
    }
]

function getAyah() {
    var num = Math.floor(Math.random() * ayaah.length);
    // console.log(ayaah[num]);

    document.getElementById("button-ayaah").innerHTML = ayaah[num].ayaah;
    document.getElementById("button-surah").innerHTML = ayaah[num].surah;

}